In [2]:
import pandas as pd

In [3]:
a = ('a','b')

In [5]:
a.append('c')

AttributeError: 'tuple' object has no attribute 'append'

In [9]:
a = {2.0: 'amlan', 4.0: 'gulfan'}

In [12]:
for i in a:
    print (a[i])

amlan
gulfan

In [28]:
a = pd.DataFrame()

In [29]:
a['Amlan'] = [1,2,3,4,5]

In [30]:
a

   Amlan
0      1
1      2
2      3
3      4
4      5

In [33]:
a.insert(0, 'Takla', ['A','B','A','B','B'])

In [34]:
a

  Takla  Gulfan  Amlan
0     A       2      1
1     B       4      2
2     A       6      3
3     B       8      4
4     B      10      5

In [23]:
print(list(a.index))

[0, 1]

In [25]:
a.index = ['A','B']

In [36]:
a[(a['Takla'] == 'A') & (a['Gulfan'] == 6)]['Amlan']

2    3
Name: Amlan, dtype: int64

In [46]:
a.groupby(['Takla'])[['Gulfan', 'Amlan']].mean()

         Gulfan     Amlan
Takla
A      4.000000  2.000000
B      7.333333  3.666667

In [52]:
a.sort_values(['Takla', 'Gulfan'], ascending = True, inplace = True)

In [56]:
a.drop_duplicates('Takla', keep = 'last')

  Takla  Gulfan  Amlan
2     A       6      3
4     B      10      5